Repository: elementary/scratch
Catalog: po/extra/*.po
Languages: es, fr, he, it, pl, ru, sr

source: The editor that works
es: El editor que funciona
fr: L'éditeur qui fait son travail

source: Code is the editor that works for you. It auto-saves your files, meaning they're always up-to-date. Plus it remembers your tabs so you never lose your spot, even in between sessions.
es: Code es el editor de texto que hace el trabajo por usted. Guarda automáticamente los archivos, de modo que siempre estarán actualizados. Además, recuerda las pestañas abiertas para no perder el hilo, incluso entre sesiones.
fr: Code est l’éditeur qui fait son travail. Il sauvegarde automatiquement vos fichiers, les conservant toujours à jour. En plus il se souvient de vos onglets ouverts pour que vous ne soyez jamais perdu, même entre deux sessions.

source: Make it yours. Code is written from the ground up to be extensible. Keep things super lightweight and simple, or install extensions to turn Code into a full-blown IDE; it's your choice. And with a handful of useful preferences, you can tweak the behavior and interface to your liking.
es: Hágalo suyo. Code fue pensado para ser ampliable. Puede mantenerlo ligero y sencillo o bien instalarle extensiones para convertirlo en un EID completo; es su elección. Además, puede ajustar el comportamiento y la interfaz como prefiera.
fr: Adaptez-le à vos besoins. Code est écrit pour être extensible. Laissez-le léger et simple, ou installez des extensions pour transformer Code en un IDE complet ; c'est vous qui voyez. Et avec des préférences utilisateurs pratiques, vous pouvez modifier le comportement de l’interface à votre goût.

source: It's elementary. Code is made to be the perfect editor for elementary, meaning it closely follows the high standards of design, speed, and consistency. It's sexy, but not distracting.
es: Es elementary. Code fue concebido para ser el editor de texto perfecto para elementary, lo que significa que sigue sus elevados estándares de diseño, velocidad y coherencia. Es atractivo, pero no le distrae.
fr: C'est facile. Code est fait pour être l’éditeur parfait pour elementary, il respecte les normes de conception, de vitesse, et de cohérence. Il est beau, sans vous faire perdre votre concentration.

source: Works with your language. Whether you're crafting code in Vala, scripting with PHP, or marking things up in HTML, Code has you covered. Experience full syntax highlighting with nearly all programming, scripting, and markup languages.
es: Funciona con el lenguaje de programación que elija. Ya sea que esté programando con Vala, PHP o HTML, Code puede manejarlo todo. Aproveche la coloración sintáctica para casi todos los lenguajes de programación, de secuencias y de marcado.
fr: Il fonctionne avec votre langage. Que vous élaboriez du code en Vala, des scripts PHP, ou des pages HTML, Code est là pour vous. Profitez d’une coloration syntaxique complète avec presque tous les langages de programmation, des scripts ou de balisage.

source: Other syntax-highlighted languages: Bash, C, C#, C++. Cmake, CSS, .Desktop, Diff, Fortran, Gettext, ini, Java, JavaScript, LaTex, Lua, Makefile, Objective C, Pascal, Perl, Python, Ruby, XML.
es: Otros lenguajes con coloración sintáctica: Bash, C, C#, C++, Cmake, CSS, .Desktop, Diff, Fortran, Gettext, ini, Java, JavaScript, LaTex, Lua, Makefile, Objective C, Pascal, Perl, Python, Ruby, XML.
fr: Autres langages avec coloration syntaxique : Bash, C, C♯, C++. Cmake, CSS, .Desktop, Diff, Fortran, Gettext, ini, Java, JavaScript, LaTex, Lua, Makefile, Objective C, Pascal, Perl, Python, Ruby, XML.
he: שפות אחרות עם הדגשת תחביר: Bash, C, C#, C++. Cmake, CSS, .Desktop, Diff, Fortran, Gettext, ini, Java, JavaScript, LaTex, Lua, Makefile, Objective C, Pascal, Perl, Python, Ruby, XML.
it: Altri linguaggi per cui è disponibile il "syntax highlighting" includono: Bash, C, C#, C++. Cmake, CSS, .Desktop, Diff, Fortran, Gettext, ini, Java, JavaScript, LaTex, Lua, Makefile, Objective C, Pascal, Perl, Python, Ruby e XML.
pl: Inne języki z kolorowanie składni: Bash, C, C#, Cmake, CSS, .Desktop, Diff, Fortran, Gettext, ini, Java, JavaScript, LaTex, Lua, MakeFile, Objective C, Pascal, Perl, Python, Ruby, XML.
ru: Другие поддерживаемые языки: Bash, C, C#, C++. Cmake, CSS, .Desktop, Diff, Fortran, Gettext, ini, Java, JavaScript, LaTex, Lua, Makefile, Objective C, Pascal, Perl, Python, Ruby, XML.
sr: Други језици истакнуте синтаксе су: Баш, Ц, Ц#, Ц++, Ц-мејк, ЦСС, .Десктоп, Дифф, Фортран, Геттекст, ини, Јава; Јава скрипт, ЛаТеКс, Луа, Мејкфајл, Објектни Ц, Паскал, Перл, Питон, Рубин, ИксМЛ.

source: Additional features include:
es: Otras características incluidas:
fr: Les dispositifs additionnels incluent :
he: תכונות נוספות כוללות:
it: Tra le caratteristiche aggiuntive vi sono:
pl: Dodatkowe funkcje obejmują:
ru: Дополнительные возможности включают:
sr: У додатне функције спадају:

source: syntax highlighting with gtksourceview-3
es: coloración sintáctica con gtksourceview-3
fr: coloration syntaxique avec gtksourceview-3
he: הדגשת תחביר באמצעות gtksourceview-3
it: "syntax highlighting" con gtksourceview-3
pl: podświetlanie składni z gtksourceview-3
ru: подсветка синтаксиса с gtksourceview-3
sr: истицање синтаксе са „gtksourceview-3“

source: a find bar to search the words in the files
es: una barra para buscar palabras dentro de archivos
fr: une barre de recherche pour chercher du contenu dans les fichiers
he: סרגל חיפוש למציאת המילים בקבצים
it: Una barra di ricerca per trovare le parole nei file
pl: pasek wyszukiwania do odnajdywania słów w plikach
ru: поиск по словам в документах
sr: трака налажења за тражење речи у датотекама

source: tab and split documents system
es: sistema de vista por pestañas y división de documentos
fr: système d’onglets et de scindage de documents
he: מערכת לשוניות ופיצול מסמכים
it: Un sistema di schede e divisione documenti
pl: karty oraz dzielony ekran dokumentów
ru: вкладки и режим разделения окна пополам
sr: систем језичака и поделе докумената

source: lots of others
es: y mucho más
fr: plein d’autres
he: ועוד הרבה נוספים
it: Molto di più
pl: wiele innych
ru: и многое другое
sr: много других

source: Minor updates:
es: Actualizaciones menores:

source: Allow Spell Checker extension in Markdown files
es: Se permite la extensión de revisión ortográfica en los archivos Markdown

source: Remember whether the sidebar is open
es: Se recuerda si la barra lateral estaba abierta

source: Add keyboard shortcuts for next and previous documents.
es: Se añadieron atajos de teclado para cambiar al documento anterior y el siguiente.

source: Fixes:
es: Correcciones:

source: Fix empty sidebar layout, ensuring folders can always be added
es: Se solucionó el problema de la barra lateral vacía, lo que garantiza que siempre puedan añadirse carpetas

source: Scroll past the end of a file
es: Desplazamiento que sobrepasa el final de un archivo

source: More efficiently save and restore window position
es: Guardado y restauración más eficientes de la posición de la ventana

source: Updated translations
es: Traducciones actualizadas
fr: Mise à jour des traductions

source: New features:
es: Funcionalidades nuevas:
fr: Nouvelles fonctionnalités :

source: Include Git status in file tooltips
es: Se incluye el estado de Git en las descripciones emergentes de los archivos

source: Option for explicit case-sensitive Find
es: Opción para buscar explícitamente con distinción de mayúsculas y minúsculas

source: Other updates:
es: Otras actualizaciones:
fr: Autres mises à jour :

source: Correctly show Toggle Comment menu item when no text is selected
es: Se muestra correctamente el elemento del menú «Conmutar comentario» cuando no se ha seleccionado texto

source: Fixed font switch alignment
es: Se corrigió la alineación del conmutador de tipos de letra

source: New "Close Other Folders" menu item to help clean up your sidebar
es: Nuevo elemento de menú «Cerrar otras carpetas» para ayudar a limpiar su barra lateral

source: Save and restore cyclic search setting
es: Se guarda y restaura la configuración de búsqueda cíclica

source: Add keyboard shortcuts to menu items
es: Se añadieron atajos de teclado a los elementos de menú

source: Make sidebar folder items not selectable
es: Ya no se pueden seleccionar los elementos de carpeta en la barra lateral

source: Center new windows
es: Las ventanas nuevas se centran

source: Visually deprioritize .gitignored files in project sidebar
es: Se desenfatizan los archivos en .gitignore en la barra lateral del proyecto
fr: Dé-prioriser visuellement dans la barre latérale les fichiers .gitignorés

source: Smart cut/copy lines with no active selection
es: Cortado/copiado inteligente de renglones sin ninguna selección activa
fr: Copier/coller intelligent sans sélection

source: Add a confirmation dialog to the "Restore" action
es: Se añadió un diálogo de confirmación a la acción «Restaurar»
fr: Ajout d'une boîte de configuration pour l'action de restauration

source: Add "Open In" menu to the top-level folder in the folder manager
es: Se añadió el menú «Abrir en» a la carpeta de nivel superior en el gestor de carpetas
fr: Ajout du menu « Ouvrir dans » au niveau supérieur du dossier dans le gestionnaire de dossiers

source: Don't show temporary files in the folder manager
es: No se muestran los archivos temporales en el gestor de carpetas
fr: Ne pas afficher de fichiers temporaires dans le gestionnaire de dossiers

source: Add brackets completion and auto-indent by default
es: Se añadió compleción de paréntesis y se activó de manera predeterminada la sangría automática
fr: Activation par défaut de la complétion des accolades et de l'indentation automatique

source: Zoom terminal plugin with keyboard
es: Es posible ampliar y reducir el complemento de la terminal con el teclado

source: Honor global privacy setting when saving and restoring
es: Se acata la configuración global de privacidad al guardar y restaurar

source: Simplify "Draw spaces" preference
es: Se simplificó la preferencia «Hacer espacios visibles»
fr: Simplification du paramètre « Afficher les espaces »

source: Fix the keyboard shortcut for going backwards in search results
es: Corrección del atajo de teclado para retroceder en los resultados de búsqueda
fr: Correction du raccourci clavier pour revenir en arrière dans les résultats de recherche

source: Fix opening files from relative paths in Terminal
es: Apertura correcta de archivos con rutas relativas en la terminal
fr: Correction de l'ouverture de fichiers à partir de chemins relatifs dans Terminal

source: Fix null file dialog when opening a new window via the dock
es: Se solucionó el mensaje de archivo vacío cuando se abre una nueva ventana por medio del dock
fr: Correction de la boîte de dialogue de fichier vide lors de l'ouverture d'une nouvelle fenêtre via le dock

source: Add "=" as a zoom key
es: Se añadió «=» como tecla de escala
fr: Ajout de « = » comme raccourci de zoom

source: Change search entry icon when results aren't found
es: El icono del cuadro de búsqueda cambia cuando no se encuentran resultados
fr: Modification de l'icône du champ de recherche quand aucun résultat n'est trouvé

source: Enter name of new file before creating it
es: Introducir el nombre del nuevo archivo antes de crearlo

source: Use Granite.MessageDialog throughout
es: Uso exhaustivo de Granite.MessageDialog
fr: Utilisation de Granite.MessageDialog

source: Include non-text files in sidebar
es: Incluir archivos que no sean de texto en la barra lateral
fr: Inclusion des fichiers non textuels dans la barre latérale

source: Fix Remove Current View
es: Corregir la eliminación de la vista actual
fr: Correction de la suppression de la vue courante

source: Fix New Window desktop action behavior
es: Corregir comportamiento de la acción de escritorio Nueva Ventana
fr: Correction du comportement de l'option « Nouvelle fenêtre » du lanceur

source: Properly synchronize Ctrl+N key presses with number of new documents spawned
es: Sincronizar correctamente las teclas Ctrl+N pulsadas con el número de nuevos documentos
fr: Synchronisation correcte du raccourci Ctrl+N avec le nombre de nouveaux documents générés

source: Build system fix for editorconfig dependency
es: Corrección del sistema de compilación para la dependencia con editorconfig
fr: Correction d'une dépendance d'editorconfig pour le système de compilation

source: Add Change Branch context menu item
es: Se añadió el elemento «Cambiar rama» en el menú contextual
fr: Ajout d'un élément de menu contextuel « Changer de branche »

source: Avoid possible startup crash related to how plugins load
es: Se evitan los posibles fallos de inicio relacionados con la carga de complementos
fr: Élimination d'un éventuel plantage au démarrage lié à la façon dont les plugins se chargent

source: Smarter file saving behavior
es: Comportamiento de guardado de archivos más inteligente
fr: Meilleur comportement d'enregistrement des fichiers

source: File saving fixes
es: Correcciones de guardado de archivos
fr: Correction de l'enregistrement des fichiers

source: Don't add temporary files to tab restore
es: No añadir archivos temporales a la restauración de pestañas
fr: Pas de fichiers temporaires ajoutés à la restauration des onglets

source: Don't recreate deleted files when restoring session
es: No recrear archivos eliminados al restaurar la sesión
fr: Pas de recréation des fichiers supprimés lors de la restauration d'une session

source: Restore line wrap preference
es: Restaurar la preferencia del envoltorio de línea
fr: Restauration des préférences d'alignement

source: Add accel tooltips
es: Se añadieron descripciones emergentes de los aceleradores
fr: Ajout des indicateurs de raccourcis

source: Minor bug fixes
es: Pequeñas correcciones de errores
fr: Corrections de bugs mineures

source: Edit code files
es: Edite archivos de código
fr: Modifier des fichiers de code

source: Code Editor
es: Editor de código
fr: Éditeur de code

source: text;IDE;scratch;
es: texto;IDE;EID;scratch;
fr: Code;IDE;EDI;scratch;éditeur;intégré;développement;texte;

source: New File
es: Archivo nuevo
fr: Nouveau fichier

source: New Window
es: Ventana nueva
fr: Nouvelle fenêtre

source: elementary LLC.
fr: elementary Inc.

source: Scratch
he: רישום
sr: Жврљко

source: Edit text files
he: עריכת קובצי טקסט
it: Modifica file di testo
pl: Edytuj pliki tekstowe
ru: Редактирование текстовых файлов
sr: Уређујте текстуалне датотеке

source: Notepad;IDE;Plain;
he: פנקס רשימות;סביבת פיתוח;פשוט;
it: Blocco Note;IDE;Ambiente di sviluppo;Normale;
pl: Notatnik;IDE;Prosty;
ru: Notepad;IDE;Plain;Блокнот;Текст;
sr: белешка;ИДЕ;обичан;

source: About Scratch
he: על אודות רישום
it: Informazioni
pl: O Scratch
ru: О программе
sr: О Жврљку

source: The text editor that works
he: עורך הטקסט שעובד
it: L'editor di testo che funziona
pl: Edytor tekstu, który działa
ru: Текстовый редактор, который работает
sr: Уређивач текста који ради

source: Scratch is the text editor that works for you. It auto-saves your files, meaning they're always up-to-date. Plus it remembers your tabs so you never lose your spot, even in between sessions.
he: רישום הוא עורך הטקסט שעובד בשבילכם. שומר באופן אוטומטי את הקבצים, כך שהם תמיד מעודכנים. בנוסף זוכר את הלשוניות כך שהמקום לא יאבד, אפילו בין הפעלות.
it: Scratch è l'editor di testo adatto te. Salva in maniera automatica i tuoi file, il che significa che sono sempre aggiornati. Inoltre si ricorda quali schede hai aperto così non rischi di perdere mai il segno, anche fra sessioni differenti.
pl: Scratch jest edytorem tekstu, który pracuje dla Ciebie. Automatycznie zapisuje Twoje pliki, co oznacza, że zawsze jesteś na bieżąco. Dodatkowo zapamiętuje Twoje zakładki, więc nigdy nie tracisz miejsca, w którym skończyłeś, nawet pomiędzy sesjami.
ru: Scratch — это текстовый редактор, который работает на вас. Он автоматически сохраняет ваши файлы, а также запоминает открытые вкладки. Вы никогда не потеряете место, на котором остановились, даже в перерывах между сессиями.
sr: Жврљко је уређивач текста који ради за вас. Сам чува ваше датотеке, што значи да су увек у најновијем издању. Поред тога памти ваше језичке тако да никада не изгубите своје место, чак и између сесија.

source: Make it yours. Scratch is written from the ground up to be extensible. Keep things super lightweight and simple, or install extensions to turn Scratch into a full-blown IDE; it's your choice. And with a handful of useful preferences, you can tweak the behavior and interface to your liking.
he: עשו אותו לשלכם. רישום מראשיתו נכתב להיות בר־הרחבה. שמרו על הדברים קלים ופשוטים, או התקינו הרחבות כדי להפוך את רישום לסביבת פיתוח משולבת (IDE) במלוא מובן המילה; זו בחירה שלכם. ובאמצעות ההעדפות השימושיות, ניתן להתאים את ההתנהגות והממשק לטעמכם.
it: Fallo tuo. Scratch è stato ideato per essere espandibile. Tienilo estremamente leggero e semplice oppure installa estensioni per trasformare Scratch in un IDE a tutti gli effetti; è una tua scelta. Tramite le utili impostazioni puoi personalizzarne il comportamento e l'interfaccia come più ti piace.
pl: Spersonalizuj to. Scratch jest napisany od początku tak, aby dało się go rozszerzać. Utrzymaj lekkość i prostotę lub zainstaluj rozszerzenia, aby zmienić Scratch w pełnowartościowe IDE - to Twój wybór. Dodatkowo z garścią użytecznych opcji możesz dostosować zachowanie i interfejs do swoich upodobań.
ru: Сделайте его своим. Scratch написан с нуля, чтобы быть расширяемым. Оставьте его легковесным и простым или установите расширения, чтобы превратить Scratch в полномасштабный IDE, выбор за вами. А с горсткой полезных настроек вы сможете изменить поведение и интерфейс по своему вкусу.
sr: Учините га вашим. Жврљко је написан из ничега да би био проширив. Држите ствари супер лаганим и једноставним, или инсталирајте додатке да претворите Жврљка у пуно радно ИДЕ; то је ваш избор. И са неколико корисних поставки, можете подесити понашање и сучеље по свом укусу.

source: It's elementary. Scratch is made to be the perfect text editor for elementary, meaning it closely follows the high standards of design, speed, and consistency. It's sexy, but not distracting.
he: הוא elementary. רישום נוצר להיות עורך הטקסט המושלם עבור elementary, כלומר עוקב אחר בתקנים הגבוהים של עיצוב, מהירות ועקביות. מושך, אך לא מסיח את הדעת.
it: È semplice. Scratch è fatto per essere l'editor di testo perfetto per elementary, ciò significa che segue scrupolosamente gli alti standard di design, velocità e stile. È esteticamente piacevole ma non ti distrarrà.
pl: To elementarne. Scratch jest stworzony, aby być doskonałym edytorem tekstu dla systemu elementary, a to znaczy, że ściśle trzyma się wysokich standardów designu, szybkości i spójności. Jest sexy, ale nie rozprasza.
ru: Это elementary. Scratch сделан, чтобы быть идеальным текстовым редактором для elementary, что означает следование высоким стандартам дизайна, скорость и последовательность. Это привлекательно, но не отвлекающе.
sr: Он је елементарни. Жврљко је направљен да буде савршен уређивач текста за елементарни, што значи да пажљиво прати високе стандарде пројектовања, брзине и доследности. Врло је љубак, али не одвраћа пажњу.

source: Works with your language. Whether you're crafting code in Vala, scripting with PHP, or marking things up in HTML, Scratch has you covered. Experience full syntax highlighting with nearly all programming, scripting, and markup languages.
he: עובד בשפה שלכם. בין אם אתם חורשים קוד ב־Vala, מסריטים עם PHP, או מתייגים דברים ב־HTML, רישום מכסה אתכם. התנסו בהדגשת תחביר מלאה כמעט בכל שפות התכנות, התסריט והתגיות.
it: Funziona con la tua lingua. Che tu stia programmando in Vala, scrivendo codice con il PHP, oppure creando in HTML, Scratch sa cosa fare. Sperimenta il sistema di "syntax highlighting" con quasi tutti i linguaggi di programmazione, scripting o markup.
pl: Działa w Twoim języku. Czy piszesz kod w języku Vala, skrypt PHP, czy markery w HTML-u, Scratch Ci w tym pomoże. Doświadcz pełnego kolorowania składni w prawie wszystkich językach programowania, skryptowych i markupowych.
ru: Работайте со своим языком. Строете ли вы код на Vala, пишите скрипты на PHP или делаете вещи на HTML, Scratch прикроет вас. Полная подсветка синтаксиса почти всех языков программирования, скриптинга и разметки.
sr: Радови и на српском језику. Без обзира да ли печете занат кодирања у Вали, скриптингу са ПХП-ом, или означавате ствари у ХТМЛ-у, Жврљко ће вам добро доћи. Искусите пуно синтаксичко истицање у готово сваким језицима програмирања, скрипти и означавања.
