Repository: elementary/scratch
Catalog: po/plugins/*.po
Languages: da, es, ja, nb

source: Brackets Completion
da: Parentes Afslutning
es: Finalización de paréntesis y corchetes
ja: ブラケット補完
nb: Fullføring av parenteser

source: Complete brackets while typing
da: Afslut parenteser mens du skriver
es: Completar corchetes mientras escribes
ja: タイピング中のブラケットを補完します
nb: Fullfør parenteser under skriving

source: Browser Preview
es: Vista previa del navegador
ja: ブラウザープレビュー
nb: Nettleserforhåndsvisning

source: Get a preview of your work in a web page
da: Se et eksempel af din kode på en webside
es: Obtenga una vista previa de su trabajo en una página web
ja: Web ページでプレビューします
nb: Få en forhåndsvisning av arbeidet ditt i en nettside

source: Share your files with Contractor
es: Comparte tus archivos con Contractor
ja: Contractor でファイルを共有します

source: Detect Indent
da: Detekter Indrykning
es: Detectar indentación
ja: インデントを検知
nb: Oppdag innrygg

source: Heuristically detect tab or space settings
da: Detekter tab eller mellemrumsindstillinger
es: Detección heurística de configuraciones de tabulación o espaciado
ja: タブやスペースの設定をヒューリスティックに検知します

source: Highlight Word Selection
da: Highlight Ord Valg
es: Resalta la palabra seleccionada
nb: Framhev ordvalg

source: Highlights all occurrences of words that are selected
da: Highlighter alle forekomster af ord, der er valgt
es: Resalta todas las apariciones de palabras seleccionadas
nb: Framhev all bruk av valgte ord

source: Open With
es: Abrir con
ja: 別のアプリで開く
nb: Åpne med

source: Open files you are editing with another application
es: Abre archivos que estás editando con otra aplicación
ja: 編集中のファイルを別のアプリで開きます
nb: Åpne filer du redigerer med et annet program

source: Outline
da: Oprids
es: Contorno
ja: アウトライン

source: Outline symbols in your current file for vala
es: Vista previa de símbolos en su archivo actual de Vala
nb: Disposisjoner symboler i gjeldende fil for vala

source: Share files with pastebin service
da: Del filer med pastebin service
es: Comparte archivos con el servicio pastebin
ja: Pastebin サービスを利用してファイルを共有する
nb: Del filer med tekstutklipplagringstjeneste

source: Preserve Indent
da: Bevar Indrykning
es: Mantener la indentación
ja: インデントを保持する
nb: Behold innrykk

source: Maintains relative indent level of pasted text
da: Bibeholder indrykningsniveauet for indsat tekst
es: Mantiene el nivel de indentado relativo del texto pegado
ja: ペーストされたテキストの相対的なインデントレベルを維持する
nb: Beholder relativt innrykksnivå for innlimt tekst

source: Spell Checker
da: Stavekontrol
es: Corrector ortográfico
ja: スペルチェッカー
nb: Stavekontroll

source: Checks the spelling of your documents
da: Kontrollerer stavningen af dine dokumenter
es: Verifica la ortografía de sus documentos
ja: ドキュメントのスペルをチェックする
nb: Sjekker stavingen i dokumentene dine

source: Strip trailing whitespace
da: Fjern efterfølgende mellemrum
es: Eliminar espacios al final de las líneas
nb: Fjern påfølgende hvit

source: Strip trailing whitespace on save
da: Fjern efterfølgende mellemrum når der gemmes
es: Eliminar espacios al final de la línea para guardar
nb: Fjern etterfølgende mellomrom ved lagring

source: A terminal in your text editor
es: Una terminal en tu editor de texto
ja: テキストエディター内のターミナル
nb: En terminal i din tekstbehandler

source: Vim Emulation
es: Emulación de Vim
ja: Vim エミュレーション
nb: Vim-emulering

source: Use Vim commands in Scratch
es: Use comandos Vim en Código
ja: Scratch で Vim コマンドを使用する
nb: Bruk Vim-kommandoer i Scratch

source: Words Completion
da: Ord Færdiggørelse
es: Terminación de palabras
ja: 単語補完
nb: Ordfullføring

source: Show a completion dialog with most used words from your files
da: Vis en færdiggørelsesdialog med de mest brugte ord fra dine filer
es: Mostrar un diálogo de terminación con las palabras más usadas de sus archivos
ja: ファイル内で最も使用された単語を補完するダイアログを表示する
nb: Vis en fullføringsdialog med de mest brukte ordene fra filene dine

source: Pastebin
nb: Tekstutklippslagringstjeneste

source: Terminal
ja: ターミナル

source: Load settings from an EditorConfig file
da: Indlæs indstillinger fra en EditorConfig-fil

source: Outline symbols in your current file for Vala
da: Se overblik over symboler i din Vala fil

source: Use Vim commands in Code
da: Brug Vim-kommandoer i Code
